tutorials/incompressible/simpleDBSFoam/est_subvol/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 3.9676e-6;

vertices
(
    (0 0 0)
    (60 0 0)
    (60 60 0)
    (0 60 0)
    (0 0 60)
    (60 0 60)
    (60 60 60)
    (0 60 60)


);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    front
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    back 
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom 
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    top 
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    left 
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    right
    {
       type patch;
        faces
        (
            (0 4 7 3)
        );
    }



);

// ************************************************************************* //
