tutorials/incompressible/simpleDBSFoam/est_subvol/0/Kinv
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Kinv;
}

dimensions      [0 -2 0 0 0 0 0];
internalField   nonuniform List<scalar>
216000
(
133868808567603.75
133868808567603.75
471698113207547.1
2178649237472767.0
4098360655737704.5
2178649237472767.0
1240694789081886.0
471698113207547.1
...
)
;

boundaryField
{
    front
    {
        type zeroGradient;
    }
    back
    {
        type zeroGradient;
    }
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    top
    {
        type zeroGradient;
    }
    bottom
    {
        type zeroGradient;
    }
}
